curious.org
#+TITLE: Curious Musings
#+OPTIONS: num:nil toc:nil \n:nil
#+TODO: TODO(t) CANCELLED(c) |  WIP(w) PUBLISHED(p)
#+hugo_base_dir: .
#+hugo_auto_set_lastmod: %Y-%m-%d
#+MACRO instagram @@html:https://www.instagram.com/p/$1

:PROPERTIES:
:EXPORT_HUGO_SECTION:
:END:
* Curious Musings
:PROPERTIES:
   :EXPORT_HUGO_SECTION: curious
   :EXPORT_FILE_NAME: _index
   :EXPORT_HUGO_LAYOUT: single
   :END:

Curious Musings is a place I put up thoughts on life, family, work,
security, the outdoors, etc.   As someone who started work at
CompuServe, the original walled garden, I am sensitive to my content
remaining free and available.

Curious Musisings is created with [[https://gohugo.io/][Hugo Go]], a free open-source site
generator. It is designed and authored on a free Linux OS using [[https://www.gnu.org/software/emacs/][Emacs]]
[[https://orgmode.org/][org-mode]] and [[https://ox-hugo.scripter.co/][ox-hugo]].  Bandwidth is currently supplied free of charge
by Github.

I am grateful to Josh Rollins for his [[https://joshrollinswrites.com/][TAONAW]] blog which I used as a
model/too for learning Hugo and ox-hugo.  The source can be found
https://github.com/jarss/
