content/curious/_index.md
+++
title = "Curious Musings"
author = ["George Jones"]
layout = "single"
lastmod = 2020-04-18T16:55:04-04:00
draft = false
+++

Curious Musings is a place I put up thoughts on life, family, work,
security, the outdoors, etc.   As someone who started work at
CompuServe, the original walled garden, I am sensitive to my content
remaining free and available.

Curious Musisings is created with [Hugo Go](https://gohugo.io/), a free open-source site
generator. It is designed and authored on a free Linux OS using [Emacs](https://www.gnu.org/software/emacs/)
[org-mode](https://orgmode.org/) and [ox-hugo](https://ox-hugo.scripter.co/).  Bandwidth is currently supplied free of charge
by Github.

I am grateful to Josh Rollins for his [TAONAW](https://joshrollinswrites.com/) blog which I used as a
model/too for learning Hugo and ox-hugo.  The source can be found
<https://github.com/jarss/>
